Revit 2027 API
View.IsAssemblyView Property
 Indicates if the view is assembly view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAssemblyView { get; }
Public ReadOnly Property IsAssemblyView As Boolean
	Get
public:
property bool IsAssemblyView {
	bool get ();
}
member IsAssemblyView : bool with get
Property Value
Boolean
See Also
Reference
View Class
Autodesk.Revit.DB Namespace